tap "aws/tap"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Color management engine supporting ICC profiles
brew "little-cms2"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Post-modern modal text editor
brew "helix"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library to render SVG files using Cairo
brew "librsvg"
# General purpose TCP-IP emulator
brew "libslirp"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@14"
# High-level interpreted language for numerical computing
brew "octave"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python dependency management tool
brew "pipenv"
# Emulator for x86 and PowerPC
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Steel Bank Common Lisp system
brew "sbcl"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["HEAD", "with-modern-doom3-icon"]
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# GPU-accelerated terminal emulator
cask "alacritty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
